Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/rent_supplement.html.txt.tmx
Source language: en
Languages: ga

source: Rent Supplement is a means-tested payment for certain people living in private rented accommodation who cannot provide for the cost of their accommodation from their own resources
ga: Ríomhfaidh Oifigeach Leasa Pobail méid an fhorlíonta cíosa agus go ginearálta cinnteoidh sé nach dtitfidh d’ioncam faoi bhun íosleibhéal tar éis duit an cíos a íoc

source: In the past, you could apply for Rent Supplement if you were qualified for social housing support and were on the local authority’s housing list
ga: Má athraíonn do chúinsí, d’fhéadfadh nach bhfuil tú incháilithe le haghaidh Forlíonta Cíos a thuilleadh nó d’fhéadfadh go n-athraíonn d’íocaíocht

source: However, people in this situation should now apply for the Housing Assistance Payment (HAP)
ga: Leigh tuilleadh faoi Fhorlíonadh Cíos agus athruithe ar do chúinsí

source: You will only qualify for Rent Supplement if you meet the eligibility criteria as specified in ‘Rules’ below
ga: Is féidir léamh ceisteanna coitianta faoi Fhorlíonadh Cíos ón Roinn Coimirce Sóisialaí freisin

source: The Housing Assistance Payment (HAP) is a form of social housing support for people who have a long-term housing need
ga: Fógraíodh teorainneacha leasaithe cíosa do Scéim Forlíonadh Cíosa i Meitheamh 2016 agus tháinig siad i bhfeidhm 1 Iúil 2016

source: It is available in all local authority areas throughout the State
ga: Baineann seo le tionóntaí reatha agus le hiarratasóirí nua ar Fhorlíonadh Cíosa

source: HAP will eventually replace long-term Rent Supplement
ga: Má tá éileamh nua ar Fhorlíonadh Cíosa á dhéanamh agat, cuirtear na teorainneacha nua cíos i bhfeidhm láithreach

source: The HAP scheme aims to allow all social housing supports to be accessed through the local authorities and to enable people to take up full-time employment and keep their housing support
ga: Féadfaidh tionóntaí a chónaíonn i mBaile Átha Cliath, Corcaigh agus Gaillimh nó i gceantair chomaitéireachta Chill Dara, na Mí agus Chill Mhantáin teacht a bheith acu ar an tSeirbhís um Chosaint Tionóntachta trí ghlao ar shaorghlao 1800 454 454

source: Read more in our document on HAP and on hap.ie
ga: Íocaíocht Cúnaimh Tithíochta (ÍCT)

source: Tax relief is available for landlords who rent to tenants getting Rent Supplement or HAP
ga: Tá an ÍCT á hoibriú i roinnt údaráis tithíochta. Faigh amach cá bhfuil an ÍCT ag oibriú

source: Read more in our document on Housing tax credits and reliefs
ga: Féach ‘Rialacha’ thíos chun teacht ar shonraí

source: Equality legislation specifies a number of grounds under which landlords cannot discriminate against potential tenants
ga: Faoin ÍCT próiseas, déanfaidh daoine atá measúnaithe i ndíth tithíochta ag údarás áitiúil, iarratas ar thacaíocht tithíochta faoin ÍCT in ionad Forlíonta Cíos

source: These include the “housing assistance” ground
ga: Idirdhealú nuair a dhéantar maoin chónaithe a ligean

source: Read more in ‘Discrimination when letting residential property’ below
ga: Baineann an reachtaíocht chomhionannais le ligean agus cóiríocht

source: Eligibility criteria for Rent Supplement following the introduction of the Housing Assistance Payment (HAP)
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar Faoiseamh agus creidmheasanna cánach i leith tithíochta

source: If you qualify for social housing support and you need help with your rent, you should apply for HAP
ga: Critéir cháilitheachta Forlíonadh Cíosa laistigh de cheantar Íocaíocht Cúnaimh Tithíochta (ÍCT)

source: You are only eligible for Rent Supplement if you are a genuine (bona fide) tenant and meet one of the following conditions:
ga: Má chónaíonn tú i gceantar ÍCT, níl tú i dteideal Forlíonadh Cíosa a fháil ach más fíor-thionónta (bona fide) thú agus má chomhlíonann tú ceann amháin de na coinníollacha a leanas:

source: • You were getting Rent Supplement in the 12 months before the date of your application
ga: • Bhí Forlíonadh Cíosa á fháil agat sna 12 mhí roimh dháta d’iarratais

source: • You were living in private rented accommodation for at least 6 months (183 days) of the last 12 months, you could afford the rent at the beginning of your tenancy and you are unable to continue to pay the rent because of a substantial change in your circumstances which occurred after you started renting
ga: • Bhí cónaí ort i gcóiríocht phríobháideach ar cíos ar feadh 6 mhí, ar a laghad, (183 lá) le 12 mhí anuas, bhí tú in ann íoc as an gcíos ag tús do thionóntachta agus níl tú in ann leanúint leis an gcíos a íoc mar gheall gur tháinig athrú suntasach ar do chúinsí a tharla i ndiaidh gur thosaigh tú le háit a ghlacadh ar cíos

source: You can combine time living in more than one rented accommodation to satisfy the 6 months (183 days)
ga: Féadfaidh tú an t-am a chaith tú ag cónaí i mbreis agus cóiríocht ar cíos amháin a chur le chéile chun an tréimhse 6 mhí (183 lá) a shásamh

source: • You were living in accommodation for homeless people for at least 6 months (183 days) of the last 12 months
ga: • Bhí cónaí ort i gcóiríocht do dhaoine gan dídean ar feadh 6 mhí (183 lá), ar a laghad le 12 mhí anuas

source: If you have already been assessed as qualified for social housing support you will be referred to your local authority to have your housing needs addressed (rather than being assessed for Rent Supplement)
ga: Má measúnaíodh thú cheana féin agus má cáilíodh thú do thacaíocht tithíochta sóisialta, atreorófar thú chuig d’údarás áitiúil go rachfar i ngleic le do riachtanais tithíochta (seachas measúnú a dhéanamh ort le haghaidh Forlíonadh Cíosa)

source: If you need help with your rent but you don’t meet these conditions, you must contact your local authority to have your housing needs assessed
ga: Mura gcomhlíonann tú na coinníollacha seo, ní mór duit teagmháil a dhéanamh le d’údarás áitiúil go ndéanfar measúnú ar do riachtanais tithíochta

source: If you are eligible for and in need of housing support you may be able to access housing under the HAP scheme or local authority housing
ga: Má tá tú i dteideal tacaíocht tithíochta a fháil agus má theastaíonn sí uait, b’fhéidir go mbeidh tú inn ann tithíocht a rochtain faoin scéim ÍCT nó trí thithíocht údaráis áitiúil

source: If you are currently getting long-term Rent Supplement (18 months or more) you can be asked to apply for social housing support to your local authority
ga: Má tá Forlíonadh Cíosa fadtéarmach á fháil agat faoi láthair (ar feadh 18 mí nó níos faide) agus má chónaíonn tú i gceantar ÍCT, féadtar iarraidh ort iarratas a dhéanamh ar thacaíocht tithíochta sóisialta chuig d’údarás áitiúil

source: You must apply within 6 weeks of being asked to do so (if necessary an extra 6 weeks can be allowed)
ga: Ní mór duit iarratas a dhéanamh laistigh de 6 seachtaine ón tráth a iarrtar ort amhlaidh a dhéanamh (más gá, féadtar 6 seachtaine sa bhreis a cheadú)

source: You may then be transferred to HAP or to another form of social housing support
ga: Critéir cháilitheachta Forlíonadh Cíosa i gceantair nach bhfuil an ÍCT á hoibriú go fóill

source: Other rules for Rent Supplement
ga: • Cóiríocht phríobháideach ar cíos

source: Rent Supplement will only be provided if the accommodation is suitable for your needs
ga: • Má tá tú measta sa 12 mhí a chuaigh thart ag údarás áitiúil mar incháilithe le haghaidh agus i ndíth tithíocht shóisialach

source: Rent Supplement is not generally paid if the rent is above the maximum rent limit set for your county (see ‘Rates’ below for information about these limits and circumstances where they may be waived)
ga: Ní féidir leat iarratas a dhéanamh ar Forlíonadh Cíos ach amháin nuair tá tú measúnaithe i ndíth tithíochta. Fad a dhéanann an t-údarás áitiúilt measúnú riachtanais tithíochta ní bheidh Forlíonadh Cíos íoctha

source: • Pass a habitual residence test
ga: • Más féidir leat triail gnáthchónaithe a phasáil

source: • Pass a means test
ga: • Más féidir leat tastáil mhaoine a phasáil

source: You won’t qualify for Rent Supplement if you:
ga: Ní bheidh tú incháilithe le haghaidh Forlíonta Cíosa má tá tú:

source: • Are in full-time employment or self-employment (30 hours or more a week)
ga: • Fostaithe nó féinfhostaithe go lánaimsearatha (30 uair a chloig sa tseachtain nó níos mó)

source: However, if you are assessed as in need of housing under the Rental Accommodation Scheme and have been out of full-time employment for 12 months or more you may be entitled to the Supplement - see ‘Employment and Rent Supplement’ below
ga: (Féach ‘Fostaíocht agus Fordheontas Cíosa’ anseo thíos.) • Má bhíonn an dara tairiscint ar chóiríocht údaráis áitiúil diúltaithe agat le linn tréimhse 12 mhí. Sa chás seo, ní bheidh tú incháilithe le Forlíonadh Cíosa a éileamh ar feadh 12 mhí

source: • Are leaving local authority housing without reasonable cause
ga: • Má tá tú ag fágáil tithíocht údaráis áitiúil gan cúis réasúnta

source: • Have been excluded from social housing by a local authority for reasons of good estate management or anti-social behaviour
ga: • Atá díshealbhaithe de thithíocht sóisialta ag údaráis áitiúil toisc cúiseanna bainistíochta eastáit maith nó iompair frithshóisialta

source: • Are attending full-time education
ga: • Ag freastal ar oideachas go lánaimseartha

source: However, if you are getting a Back to Education Allowance (BTEA), are participating in the Back to Education Programme or in the Momentum Programme you may be entitled to Rent Supplement
ga: Ach má tá tú ag fáil an Liúntais um Filleadh ar an Oideachas ná ag glacadh páirte sa Chlár um Filleadh ar Oideachas nó an clár Momentum b’fhéidir go mbeidh teideal agat ar an bhFordheontas

source: Renting from a parent: You cannot get Rent Supplement to help you pay rent to your parent if you are living in the family home
ga: Ag íoc cíos do thuismitheoir: Má tá tú i do chónaí sa teach teaghlaigh agus má íocann tú cíos le do thuismitheoir ní bhfaigheadh tú Forlíonadh Cíos

source: If your parent owns a second property, you will generally not get Rent Supplement for this property unless you can prove that you are a genuine (bona fide) tenant
ga: Má tá dara réadmhaoin ag do thuismitheoir, ní bhfaigheadh tú Forlíonadh Cíos go ginearálta, ach amháin más féidir leat cruthú gur tionóntacht fhíor (bona fide) thú

source: Sharing with your landlord: You may be entitled to get Rent Supplement if you are living in your landlord’s home
ga: Ag cónaí le do thiarna talún: B’fhéidir go bhfuil tú i dteideal Forlíonadh Cíosa a fháil má tá tú ag cónaí i dteach do thiarna talún

source: It must be a genuine landlord/tenant arrangement
ga: Ní mór gur fíor-shocrú tiarna talún/tionónta atá ann

source: Your landlord has to fill in part of the form and provide his or her PPS number (see 'How to apply' below)
ga: Tá ar do thiarna talún cuid den fhoirm a chomhlánú agus a (h)uimhir PSP a sholáthar (féach ‘Conas iarratas a dhéanamh’ thíos)

source: Employment and Rent Supplement
ga: Forlíonadh Cíos agus fostaíochta

source: You will not qualify for Rent Supplement if you are in full-time employment - defined as 30 hours or more a week
ga: Ní bheidh tú incháilithe don Fhorlíonadh Cíosa má tá tú fostaithe go lánaimseartha (30 uair a chloig sa tseachtain nó níos mó)

source: (In the case of couples, if one of a couple is in full-time employment, both are excluded from claiming Rent Supplement.) Claims from self-employed people are assessed on the individual circumstances of the case and you may be asked to show that you are working less than 30 hours a week
ga: (I gcás lánúnacha, má tá duine de lánúin fostaithe go lánaimseartha beidh an bheirt acu eisiata maidir le forlíonadh cíosa a éileamh). Measúnaítear éilimh ó dhaoine féinfhostaithe i leith cúinsí aonair an cháis agus d’fhéadfaí iarraidh ort a thaispeáint go bhfuil tú ag oibriú faoi bhun 30 uair sa tseachtain

source: If you are working over 30 hours a week in employment or self-employment, or if you are getting the Back to Work Enterprise Allowance, you must be deemed eligible for the Rental Accommodation Scheme (RAS) by your local authority to continue to get Rent Supplement
ga: Má tá tú ag obair os cionn 30 uair sa tseachtain i bhfostaíocht nó i bhféinfhostaíocht nó má fhaigheann tú Liúntas Fiontraíochta um Fhilleadh ar Obair, ní mór do d’údarás áitiúil a mheas go bhfuil tú i dteideal bheith rannpháirteach sa Scéim Cóiríochta Cíosa (SCC) go leanfaidh tú le Forlíonadh Cíosa a fháil

source: However, you will be reassessed for Rent Supplement and some of your additional income including some of your income from employment will be taken into account
ga: Déanfar athmheasúnú ort le haghaidh Forlíonta Cíosa agus tabharfar cuid de d’ioncam breise san áireamh lena n-áirítear cuid de d’ioncam ó fhostaíocht

source: As a result of the reassessment you may or may not continue to qualify for Rent Supplement
ga: De thoradh an athmheasúnaithe, b’fhéidir go leanfaidh tú de bheith incháilithe le haghaidh Forlíonta Cíosa agus b’fhéidir nach leanfaidh

source: If you do qualify for Rent Supplement you may get a different rate of Supplement
ga: Má tá tú incháilithe le haghaidh Forlíonta Cíosa b’fhéidir go bhfaighfeá ráta difriúil forlíonta

source: Income taken into account for Rent Supplement
ga: Ioncam atá tógtha san áireamh d’Fhorlíonadh Cíosa

source: • Net income from employment (this is gross income less PRSI and reasonable travel expenses
ga: • Ioncam glan ó fhostaíocht (sin ioncam comhlán lúide ÁSPC agus costais taistil réasúnta

source: A child dependant in full-time education does not have their income from employment assessed as means for Rent Supplement.)
ga: Má bhíonn leanbh cleithiúnach agus in oideachas lánaimseartha, ní ghlacfar a hioncam ó fhostaíocht san áireamh.)

source: • Social welfare payments (for exceptions - see 'Income not taken into account' below)
ga: • Íocaíochtaí leasa shóisialaigh (tá eisceachtaí ann, féach ‘Ioncam nach gcuirtear san áireamh’ thíos)

source: • Cash income (for example, maintenance)
ga: • Ioncam in airgead tirim (mar shampla, cothabháil)

source: • All income and the value of all property of which the claimant deprived themselves in order to qualify for Supplementary Welfare Allowance (SWA)*
ga: • Ioncam agus luach na maoine ar fad go mb’fhéidir gur choinnigh an éilitheoir uaidh/uaithi féin le bheith incháilithe do LLS

source: • Capital (for example, property except your own home, savings and investments)
ga: • Caipiteal (mar shampla, maoin seachas do theach féin, coigiltis agus infheistíochtaí)

source: The capital value of property (except your own home), savings and investments is assessed as follows:
ga: Déanfar luach caipitil maoine (seachas do theach féin), infheistíochtaí agus coigiltis a mheasúnú ar bhonn seachtainiúil mar seo a leanas:

source: │Capital │Weekly means assessed as │
ga: │Caipiteal: │Maoin sheachtainiúil measúnaithe mar: │

source: │First €5,000 │Nil │
ga: │An chéad €5,000 │Dada │

source: │Next €10,000 │€1 per €1,000 │
ga: │An chéad €10,000 eile │€1 in aghaidh gach €1,000 │

source: │Next €25,000 │€2 per €1,000 │
ga: │An chéad €25,000 eile │€2 in aghaidh gach €1,000 │

source: │Any capital over €40,000 │€4 per €1,000. │
ga: │Caipiteal ar bith os cionn €40,000 │€4 in aghaidh gach €1,000 │

source: Income not taken into account when calculating Rent Supplement
ga: Ioncam nach nglactar san áireamh agus Forlíonadh Cíosa á áireamh

source: Income from the following sources is disregarded - not taken into account - when calculating the amount of Rent Supplement you qualify for:
ga: Déanfar neamhaird d’ioncam ó na foinsí seo a leanas nó ní ghlacann an Oifigeach Leasa Pobail (CWO) san áireamh iad nuair a dhéantar áireamh ar mhéid an Fhorlíonta Cíosa a gheobhaidh tú:

source: • An amount equal to the Supplementary Welfare Allowance (SWA) rate for your household circumstances
ga: • Méid cothrom leis an ráta Liúntas Leasa Fhorlíontaigh ag brath ar do chúinsí theaghlaigh féin

source: • Foster care payments from the Health Service Executive (HSE)
ga: • Íocaíochtaí cúraim altrama ó Fheidhmeannacht na Seirbhíse Sláinte

source: • Payments for accommodating children under the Child Care Act
ga: • Íocaíochtaí as cóiríocht a thabhairt do leanaí faoin Acht um Chúram Leanaí

source: • Income from Gaeltacht students
ga: • Ioncam ó mhic léinn Ghaeltachta

source: • Grants or allowances from schemes promoting the welfare of blind people
ga: • Deontais nó liúntais ó scéimeanna a chothaíonn leas na ndaoine dalla

source: • Money received from charitable organisations, for example, St Vincent de Paul
ga: • Airgead a fhaightear ó eagraíochtaí carthanacha, mar shampla, Naomh Uinseann de Pól

source: • Compensation awarded by the Compensation Tribunal in respect of Hepatitis C contracted from certain blood products, to those who have disabilities caused by Thalidomide and to those receiving compensation under the Residential Institutions Redress Board
ga: • Cúiteamh a dhámh an Binse Cúitimh maidir le Heipitíteas C a tolgadh ó tháirgí fola áirithe, dóibh sin a bhfuil míchumas orthu de dheasca Tailídimíde, agus dóibh sin a fhaigheann cúiteamh faoi Bhord Sásaimh na nInstitiúidí Cónaitheacha

source: • Carer's Support Grant • Guardian's Payment (Contributory) and Guardian's Payment (Non-Contributory)
ga: • Íocaíocht Chaomhnóra (Ranníocach) agus Íocaíocht Chaomhnóra (Neamh-Ranníocach)

source: • Fuel Allowance and the Living Alone Allowance
ga: • Liúntas Breosla agus Liúntas Maireachtála Aonair

source: • Pensioners: If you are aged 65 or over (or where one of a couple is of pensionable age) and have a combined household income greater than the rate of SWA appropriate to your household circumstances, the difference between the maximum rate of State Pension (Contributory) appropriate to your circumstance and the rate of SWA appropriate to your circumstances is not taken into account
ga: • Pinsinéirí: Má tá tú 65 bliain d’aois nó níos sine (nó sa chás go bhfuil aois an phinsin bainte amach ag duine den chúpla) agus má tá ioncaim teaghlaigh chomhcheangailte níos mó ná an ráta SWA iomchuí do do chúinsí teaghlaigh, ní thógfar an difríocht idir an ráta íosta de Phinsean Stáit (Ranníocach) iomchuí le do chúinsí agus an ráta LLF iomchuí le do chúinsí san áireamh

source: • Carers' payments: The half-rate Carer's Allowance is not taken into account
ga: • Íocaíochtaí cúramóirí: Ní thógfar Liúntas Cúramóra leath-ráta san áireamh riamh

source: • If you are getting Carer's Allowance, the amount of Carer's Allowance above the appropriate SWA rate for your situation (either the qualified adult rate for a couple or the personal rate of SWA) is not taken into account
ga: • Má tá tú ag fáil Liúntas Cúramóra, ní thógfar méid an liúntais thar an ráta LLF iomchuí do do chúinsí (an ráta do dhuine fásta cleithiúnach do chúpla nó an ráta LLF pearsanta) san áireamh

source: So if you are one of a couple and getting Carer's Allowance, the amount of Carer's Allowance being paid less the SWA qualified adult rate is not taken into account. If you are single or a lone parent the amount disregarded is the rate of Carer's Allowance being paid less the personal rate of SWA
ga: Mar sin, más duine de chúpla thú agus má tá tú ag fáil Liúntas Cúramóra, ní thógtar méid an Liúntais Cúramóra atá á íoc lúide an ráta duine fásta cleithiúnach LLF san áireamh agus más duine singil nó más tuismitheoir aonair thú is é an mhéid ar a ndéantar neamhaird uirthi ná ráta an Liúntais Cúramóra atá á íoc lúide an ráta pearsanta de LLF

source: • Any amount of Carer's Benefit in excess of the basic SWA rate for your situation (either the qualified adult rate or the personal rate of SWA) is not taken into account
ga: • Ní thógtar méid ar bith de Shochar Cúramóra thar an bunráta LLF do do chúinsí (an ráta duine fásta cleithiúnach nó an ráta pearsanta LLF) san áireamh

source: • Rehabilitative earnings disregard: A certain amount of your income from rehabilitative work is not taken into account
ga: • Neamhaird Tuillimh Athshlánúcháin is ea méid áirithe den ioncam atá agat ó obair athshlánúcháin nach dtógtar san áireamh

source: If you are getting Disability Allowance or Blind Pension, €120 from rehabilitative training or employment is not taken into account in the assessment for Rent Supplement
ga: Má tá Liúntas Míchumais nó Pinsean na nDall á fháil agat, ní thógtar €120 ó oiliúint nó fostaíocht athshlánúcháin san áireamh sa mheasúnú maidir le Forlíonadh Cíosa

source: Any earnings over €120 from rehabilitative training or employment will affect your Rent Supplement
ga: Tógtar gach tuilleamh os cionn €120 ó oiliúint nó fostaíocht athshlánúcháin san áireamh agus beidh tionchar aige ar an bhForlíonadh Cíosa atá agat

source: If you are earning above €120 you can be assessed using whichever disregard is most in your interest - either the Rehabilitative earnings disregard or the Additional income disregard (but not both)
ga: Má tá tú ag tuilleamh os cionn €120, is féidir measúnú a dhéanamh ort trí Neamhaird Tuillimh Athshlánúcháin nó Neamhaird Ioncaim Teaghlaigh a úsáid (ní féidir an dá cheann a úsáid), cibé atá chun do leasa

source: • Additional income disregard: A certain amount of your household income from certain sources is not taken into account
ga: • Neamhaird Ioncaim Teaghlaigh: Ní thugtar méid áirithe de d'ioncam teaghlaigh ó fhoinsí áirithe san áireamh

source: €75 of any additional household income* above the SWA rate for your circumstances is not taken into account
ga: Ní thugtar €75 de ioncam teaghlaigh bhreise* a sháraíonn an ráta cuí SWA do do chás san áireamh

source: Also, 25% of additional household income over €75 is not taken into account
ga: Ní thógtar 25% den ioncam teaghlaigh bhreise atá agat os cionn €75 san áireamh freisin

source: There is no upper limit on the amount that can be disregarded
ga: Níl aon uasteorainn ar an méid gur féidir neamhaird a dhéanamh de

source: *Additional household income is income from part-time employment or part-time self-employment, Family Income Supplement (FIS), Community Employment (CE), the Tús scheme, JobBridge,the Rural Social Scheme, Momentum, Part-time Job Incentive Scheme, Skillnets, Work Placement Scheme, Gateway, Back to Work Allowance, Back to Work Enterprise Allowance or a FET (formerly FÁS) course
ga: *Ioncam teaghlaigh bhreise is ea ioncam ó fhostaíocht pháirtaimseartha nó féinfhostaíocht pháirtaimseartha, Forlíonadh Ioncaim Teaghlaigh, Fostaíocht Pobail (FP), Tús, JobBridge, Rural Social Scheme, Momentum, Part-time Job Incentive Scheme, Skillnets, Work Placement Scheme, Gateway, Liúntas um Fhilleadh ar Obair, Liúntas Fiontraíochta um Fhilleadh ar Obair nó cúrsa SOLAS (FÁS)

source: Part of a maintenance payment is also assessed as additional household income (see below)
ga: Déantar cothabháil a mheasúnú mar ioncam teaghlaigh bhreise freisin (féach thíos)

source: Maintenance and Rent Supplement
ga: Cothabháil agus Forlíonadh Cíosa

source: Maintenance is assessed as additional household income (see above) and maintenance payments up to €95.23 per week are assessed in full
ga: Déantar cothabháil a mheasúnú mar 'ioncam teaghlaigh bhreise' (féach thuas) agus déantar íocaíochtaí chothabhála suas go dtí €95.23 in aghaidh na seachtaine a mheasúnú ar an iomlán (mar gheall go meastar gur ranníocaíocht iad i dtreo do chostas tithíochta)

source: The household income disregard (see above) applies to maintenance payments above this amount
ga: Baineann an Neamhaird Ioncaim Teaghlaigh le híocaíochtaí chothabhála os cionn an méid seo
